Infineon/AURIX_code_examples/code_examples/TC29xTP_BC-step/Project2/Libraries/iLLD/TC29B/Tricore/Stm/Std/IfxStm.h
/** \brief OCDS Suspend Control (OCDS.SUS)
 */
typedef enum
{
    IfxStm_SuspendMode_none = 0,  /**< \brief No suspend */
    IfxStm_SuspendMode_hard = 1,  /**< \brief Hard Suspend */
    IfxStm_SuspendMode_soft = 2   /**< \brief Soft Suspend */
} IfxStm_SuspendMode;

/** \} */

/******************************************************************************/
/*-----------------------------Data Structures--------------------------------*/
/******************************************************************************/

/** \addtogroup IfxLld_Stm_Std_Structures
 * \{ */
/** \brief Comparator Configuration Structure
 */
typedef struct
{
    IfxStm_Comparator          comparator;                /**< \brief Comparator Id defined in   MODULE_STMx.ISCR.B.CMP0IRR(x = 0, 1, 2). */
    IfxStm_ComparatorInterrupt comparatorInterrupt;       /**< \brief Comparator Interrupt request source defined in MODULE_SRC.STM.STM[index].SRx (x =0, 1). */
    IfxStm_ComparatorOffset    compareOffset;             /**< \brief Comparator start bit position  defined in MODULE_STMx.CMCON.B.MSTART0(x = 0,1,2). */
    IfxStm_ComparatorSize      compareSize;               /**< \brief Size of compare value to compare with timer defined in  MODULE_STMx.CMCON.B.MSIZE0(x = 0,1,2). */
    uint32                     ticks;                     /**< \brief count for next comparison from current timer count. */
    Ifx_Priority               triggerPriority;           /**< \brief Interrupt priority. Range = 0 .. 255. 0 = interrupt is disabled. */
    IfxSrc_Tos                 typeOfService;             /**< \brief Type of service. */
} IfxStm_CompareConfig;

/** \} */

/** \addtogroup IfxLld_Stm_Std_Module
 * \{ */

/******************************************************************************/
/*-------------------------Inline Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Returns system timer value.
 * \param stm pointer to System timer module registers.
 * \return system timer value.
 */
IFX_INLINE uint64 IfxStm_get(Ifx_STM *stm);

/** \brief Returns the system timer frequency.
 * \param stm pointer to System timer module registers.
 * \return the system timer frequency in Hz.
 */
IFX_INLINE float32 IfxStm_getFrequency(Ifx_STM *stm);

/** \brief Returns the module's suspend state.
 * TRUE :if module is suspended.
 * FALSE:if module is not yet suspended.
 * \param stm Pointer to STM module registers
 * \return Suspend status (TRUE / FALSE)
 */
IFX_INLINE boolean IfxStm_isModuleSuspended(Ifx_STM *stm);

/** \brief Configure the Module to Hard/Soft suspend mode.
 * Note: The api works only when the OCDS is enabled and in Supervisor Mode. When OCDS is disabled the OCS suspend control is ineffective.
 * \param stm Pointer to STM module registers
 * \param mode Module suspend mode
 * \return None
 */
IFX_INLINE void IfxStm_setSuspendMode(Ifx_STM *stm, IfxStm_SuspendMode mode);

/******************************************************************************/
/*-------------------------Global Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Disables the Stm module
 * \param stm pointer to STM registers
 * \return None
 */
IFX_EXTERN void IfxStm_disableModule(Ifx_STM *stm);

/** \brief enable suspend by debugger.
 * \param stm pointer to System timer module registers.
 * \return None
 */
IFX_EXTERN void IfxStm_enableOcdsSuspend(Ifx_STM *stm);

/** \brief Returns the module index of the selected STM module
 * \param stm Pointer to STM module registers
 * \return STM module register address
 */
IFX_EXTERN Ifx_STM *IfxStm_getAddress(IfxStm_Index stm);

/** \brief API to get the resource index of the STM specified.
 * \param stm pointer to System timer module registers.
 * \return system timer module index.
 */
IFX_EXTERN IfxStm_Index IfxStm_getIndex(Ifx_STM *stm);

/** \} */

/** \addtogroup IfxLld_Stm_Std_Timer
 * \{ */

/******************************************************************************/
/*-------------------------Inline Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Returns the lower system timer value.
 * \param stm pointer to System timer module registers.
 * \return the lower system timer value.
 */
IFX_INLINE uint32 IfxStm_getLower(Ifx_STM *stm);

/** \brief Gets the TIM3 couter value.
 * \param stm pointer to System timer module registers.
 * \return TIM3 counter value.
 */
IFX_INLINE uint32 IfxStm_getOffset12Timer(Ifx_STM *stm);

/** \brief Gets the TIM4 couter value.
 * \param stm pointer to System timer module registers.
 * \return TIM4 counter value.
 */
IFX_INLINE uint32 IfxStm_getOffset16Timer(Ifx_STM *stm);

/** \brief Gets the TIM5 couter value.
 * \param stm pointer to System timer module registers.
 * \return TIM5 counter value.
 */
IFX_INLINE uint32 IfxStm_getOffset20Timer(Ifx_STM *stm);

/** \brief Gets the TIM6 couter value.
 * \param stm pointer to System timer module registers.
 * \return TIM6 counter value.
 */
IFX_INLINE uint32 IfxStm_getOffset32Timer(Ifx_STM *stm);

/** \brief Gets the TIM1 couter value.
 * \param stm pointer to System timer module registers.
 * \return TIM1 counter value.
 */
IFX_INLINE uint32 IfxStm_getOffset4Timer(Ifx_STM *stm);

/** \brief Gets the TIM2 couter value.
 * \param stm pointer to System timer module registers.
 * \return TIM2 counter value.
 */
IFX_INLINE uint32 IfxStm_getOffset8Timer(Ifx_STM *stm);

/** \brief Returns the timer value shifted right by offset.
 * \param stm pointer to System timer module registers.
 * \param offset offset value.
 * \return the lower system timer value shifted by offset.
 */
IFX_INLINE uint32 IfxStm_getOffsetTimer(Ifx_STM *stm, uint8 offset);

/** \brief Wait for requested time.
 * The macro waits in while loop for the specified time in system timer ticks.
 * \param stm pointer to System timer module registers.
 * \param ticks ticks Wait time in system timer ticks.
 * \return None
 */
IFX_INLINE void IfxStm_waitTicks(Ifx_STM *stm, uint32 ticks);

